# Abschlussprüfung
Laden sie die Datenbank mit den folgenden zwei Codeblöcken in die Laufzeit und lösen sie die Aufgaben darunter.

In [ ]:
%%capture
!pip install ipython-sql
!pip install gdown
!gdown https://drive.google.com/uc?id=1eQBiYG0Jp6s7uGo2lLrF5XTQ_Pb2gRIX
%load_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [ ]:
%%capture !wget
%sql sqlite:///chinook.db

Verwenden Sie das Diagramm der Datenbank (siehe Moodle) als Anhaltspunkt zur Struktur der Datenbank und Aufbau der jeweiligen Tabelle und ihre Verweise.

In [7]:
from IPython.display import Image, display

url = "https://github.com/user-attachments/assets/d8d81d4f-0ee1-4c42-b3ed-b819e90e9d2a"

display(Image(url=url))

---

**Aufgabe 1**

1.   Erstellen Sie eine Tabelle mit dem Namen "TestUser" und den Feldern id, name, birthdate und score. Wählen Sie die Datentypen entsprechend. Achten Sie dabei darauf dass id automatisch vergeben wird und in score eine Gleitkommazahl eingetragen werden kann.
2.   Fügen sie einen Daten Satz ein mit dem Namen 'Kurt Test', Geburtsdatum '1980-01-01' und einem Score von 37.5
3.   Fügen sie einen Daten Satz ein mit dem Namen 'Julia Check', Geburtsdatum '1985-05-05' und einem Score von 81.7
4.   Aktualisieren Sie den Datensatz aus Punkt 2 und ändern damit den Namen auf 'Astrid Test'
5.   Löschen Sie den Datensatz aus Punkt 3
6.   Löschen Sie die ganze Tabelle

Führen Sie zwischen den Punkten das jeweils vorbereitete SELECT Statement aus um die Zwischenergebnisse zu prüfen.

In [ ]:
%%sql
-- 1
create table TestUser (
    id        integrt primary key autoincrement,
    name      text not null,
    birthdate date not null,
    score     real not null
);

 * sqlite:///chinook.db
Done.

[]

In [ ]:
%%sql
-- 2
insert into TestUser (name, birthdate, score) values ('kurt test', '1980-01-01', 37.5);

 * sqlite:///chinook.db
1 rows affected.

[]

In [ ]:
%%sql
-- 3
insert into TestUser (name,
                      birthdate,
                      score)
values ('julia check',
        '1985-05-05',
        81.7);

 * sqlite:///chinook.db
1 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM TestUser

 * sqlite:///chinook.db
Done.

[(1, 'kurt test', '1980-01-01', 37.5), (2, 'julia check', '1985-05-05', 81.7)]

In [ ]:
%%sql
-- 4
update TestUser set name = 'astrid test' where name = 'kurt test';

 * sqlite:///chinook.db
1 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM TestUser

 * sqlite:///chinook.db
Done.

[(1, 'astrid test', '1980-01-01', 37.5),
 (2, 'julia check', '1985-05-05', 81.7)]

In [ ]:
%%sql
-- 5
delete from TestUser where name = 'julia check';

 * sqlite:///chinook.db
1 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM TestUser;

 * sqlite:///chinook.db
Done.

[(1, 'astrid test', '1980-01-01', 37.5)]

In [ ]:
%%sql
-- 6
drop table TestUser;

 * sqlite:///chinook.db
Done.

[]

**Aufgabe 2**
Erstellen Sie eine View mit dem Namen "big3_customers" in der Sie die Customers Tabelle so filtern, dass nur Customer mit den Company Einträgen 'Apple Inc.', 'Microsoft Corporation' oder 'Google Inc.' über bleiben. Weiters sollen nur die Spalten Company, FirstName, LastName und Email angezeigt und nach Company sortiert werden.
Prüfen Sie das Ergebnis durch ausführen des vorbereiteten SELECT Statements.

In [ ]:
%%sql
create view big3_customers as
                            select company, firstname, lastname, email
                            from customers
                            where company in ('Apple Inc.', 'Microsoft Corporation', 'Goofle Inc')
                            order by company
                            ;

 * sqlite:///chinook.db
(sqlite3.OperationalError) table big3_customers already exists
[SQL: create view big3_customers as
                            select company, firstname, lastname, email
                            from customers
                            where company in ('Apple Inc.', 'Microsoft Corporation', 'Goofle Inc')
                            order by company
                            ;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
SELECT * FROM big3_customers;

 * sqlite:///chinook.db
Done.

[]

**Aufgabe 3**
Fragen Sie die Datenbank über die Tabellen media_types und tracks so ab, dass Sie alle Tracks nach Media Type filtern, die 'video file' im Namen enthalten. Errechnen Sie in der Abfrage gruppiert nach GenreId die durchschnittliche Milliseconds Anzahl. Diese Durchschnittswerte sollen durch 60000 dividiert und auf 2 Kommastellen gerundet werden. Nennen Sie die Spalten entsprechend GenreId und avgMinutes.

In [ ]:
%%sql
select
    t.genreid,
    round(avg(t.milliseconds) / 60000, 2) avgMinutes -- 2 Kommastellen
from
    tracks t
join
    media_types as m on t.mediatypeid = m.mediatypeid
where
    m.name like '%video file%'
group by t.genreid;

 * sqlite:///chinook.db
Done.

[(18, 43.76), (19, 35.75), (20, 48.53), (21, 42.92), (22, 26.42), (23, 4.9)]

**Aufgabe 4**
Fragen Sie die Datenbank über mehrere Tabellen so ab, dass Sie alle Playlists anzeigen, die mindestens einen Track des Genre mit Namen 'Classical' beinhaltet. Die Abfrage soll Id und Namen der Playlists einmalig anzeigen, wenn ein entsprechender Track in ihr enthalten ist.

In [ ]:
%%sql
select distinct
    p.playlistid,
    p.name as playlistname
from
    playlists as p
join
    playlist_track as pt on p.playlistid = pt.playlistid
join
    tracks t on pt.trackid = t.trackid
join
    genres g on t.genreid = g.genreid
where
    g.name = 'Classical';

 * sqlite:///chinook.db
Done.

[(1, 'Music'),
 (5, '90’s Music'),
 (8, 'Music'),
 (12, 'Classical'),
 (15, 'Classical 101 - The Basics'),
 (14, 'Classical 101 - Next Steps'),
 (13, 'Classical 101 - Deep Cuts')]

**Aufgabe 5**
Fragen Sie die Datenbank über die Tabellen Employees, Customers und Invoices, so ab, dass Sie First und LastName des Employee und die Summe der Invoices aller Customers, die der Employee betreut anzeigt.

**WICHTIG** Verwenden Sie für die Abfrage JOINs!

*Hinweis* In der Tabelle Customers wird SupportRepId als Fremdschlüssel zum Primärschlüssel EmployeeId der Employees Tabelle verwendet.

In [ ]:
%%sql
select
    e.firstname as employee_firstname,
    e.lastname as employee_lastname,
    round(sum(i.total), 2) as total_invoices
from
    employees e
join
    customers c on e.employeeid = c.supportrepid
join
    invoices i on c.customerid = i.customerid
group by e.employeeid, e.firstname, e.lastname
order by total_invoices desc;

 * sqlite:///chinook.db
Done.

[('Jane', 'Peacock', 833.04),
 ('Margaret', 'Park', 775.4),
 ('Steve', 'Johnson', 720.16)]

**Aufgabe 6**
Lösen Sie die Aufgabe 5 nun mit Sub-Queries anstatt Joins.

*Hinweis* Employees die keine Customer betreuen sollen aus dem Ergebnis herausgefiltert werden.

In [ ]:
%%sql
select
    e.firstname as employee_firstname,
    e.lastname as employee_lastname,
    round((
        select sum(i.total)
        from invoices as i
        where i.customerid in (
            select c.customerid
            from customers c
            where c.supportrepid = e.employeeid
                               )
           ), 2) as total_invoices
from employees as e
where
    e.employeeid in (
        select distinct c.supportrepid
        from customers c
    )
order by total_invoices desc;

 * sqlite:///chinook.db
Done.

[('Jane', 'Peacock', 833.04),
 ('Margaret', 'Park', 775.4),
 ('Steve', 'Johnson', 720.16)]

**Aufgabe 7**
Sie sollen über die Invoices Tabelle den Total Wert jeder Rechnung im verrechnenden Land (BillingCountry) laufend aufsummieren (Running_Total). Das Ergebnis soll BillingCountry, InvoiceDate, Total, sowie Running_Total anzeigen.
*   Bei der Berechnung der kumulierten Summe von Total sollen zuerst Invoices mit neuerem Datum herangezogen werden.
*   Sortieren Sie das Endergebnis aufsteigend nach BillingCountry und dann Running_Total.

Geben Sie die ersten 10 Zeilen zurück.

In [ ]:
%%sql
select
    billingcountry,
    invoicedate,
    total,
    sum(total)
        over (
        partition by billingcountry
        order     by invoicedate desc
               ) as running_total
from invoices
order by billingcountry, running_total
limit 10;

 * sqlite:///chinook.db
Done.

[('Argentina', '2013-11-08 00:00:00', 8.91, 8.91),
 ('Argentina', '2013-03-10 00:00:00', 13.86, 22.77),
 ('Argentina', '2013-01-28 00:00:00', 1.98, 24.75),
 ('Argentina', '2011-08-07 00:00:00', 0.99, 25.74),
 ('Argentina', '2010-12-17 00:00:00', 5.94, 31.68),
 ('Argentina', '2010-09-14 00:00:00', 3.96, 35.64),
 ('Argentina', '2010-06-12 00:00:00', 1.98, 37.62),
 ('Australia', '2012-08-31 00:00:00', 8.91, 8.91),
 ('Australia', '2012-01-01 00:00:00', 13.86, 22.77),
 ('Australia', '2011-11-21 00:00:00', 1.98, 24.75)]